4G
5G
absent-minded
anti-american
anti-israeli
anti-occupation
anti-proliferation
anti-semites
anti-social
anti-us
anti-white
back-logged
back-wood
back-woods
bid-rigging
break-up
break-ups
broken-hearted
cash-strapped
counter-productive
die-hard
dilly-dally
drop-out
drop-outs
election-rigger
far-fetched
farcical-yet-provocative
fat-cat
fat-cats
flat-out
full-blown
get-rich
god-awful
hard-hit
hard-line
hard-liner
head-aches
heavy-handed
heavy-duty
hell-bent
high-priced
ho-hum
ill-advised
ill-conceived
ill-defined
ill-designed
ill-fated
ill-favored
ill-formed
ill-mannered
ill-natured
ill-sorted
ill-tempered
ill-treated
ill-treatment
ill-usage
ill-used
job-killing
laid-off
lame-duck
last-ditch
layoff-happy
left-leaning
less-developed
lesser-known
life-threatening
little-known
long-time
long-winded
low-rated
martyrdom-seeking
multi-polarization
muscle-flexing
non-confidence
one-sided
over-acted
over-awe
over-balanced
over-hyped
over-priced
over-valuation
rip-off
run-down
screw-up
screwed-up
second-class
second-tier
self-coup
self-criticism
self-defeating
self-destructive
self-humiliation
self-interest
self-interested
self-serving
semi-retarded
set-up
short-lived
slow-moving
so-cal
spoon-fed
spoon-feed
sub-par
sugar-coat
sugar-coated
terror-genic
thumb-down
thumbs-down
time-consuming
tin-y
top-heavy
two-faced
two-faces
ultra-hardline
un-viewable
war-like
washed-out
water-down
watered-down
all-around
best-known
best-performing
best-selling
better-known
better-than-expected
brand-new
clear-cut
cost-effective
cost-saving
counter-attack
counter-attacks
cure-all
dead-cheap
dead-on
dirt-cheap
dummy-proof
easy-to-use
energy-efficient
energy-saving
err-free
eye-catch
eye-catching
fast-growing
fast-paced
fastest-growing
feature-rich
fine-looking
first-class
first-in-class
first-rate
god-given
god-send
hands-down
hard-working
high-quality
high-spirited
issue-free
jaw-droping
jaw-dropping
kid-friendly
large-capacity
law-abiding
light-hearted
long-lasting
low-cost
low-price
low-priced
low-risk
lower-priced
mind-blowing
multi-purpose
non-violence
non-violent
pain-free
pre-eminent
problem-free
problem-solver
razor-sharp
record-setting
risk-free
rock-star
rock-stars
self-determination
self-respect
self-satisfaction
self-sufficiency
self-sufficient
state-of-the-art
thumb-up
thumbs-up
time-honored
toll-free
top-notch
top-quality
trouble-free
ultra-crisp
user-friendly
user-replaceable
well-backlit
well-balanced
well-behaved
well-being
well-bred
well-connected
well-educated
well-established
well-informed
well-intentioned
well-known
well-made
well-managed
well-mannered
well-positioned
well-received
well-regarded
well-rounded
well-run
well-wishers
world-famous
worth-while
